In [1]:
import pandas as pd
import numpy as np

In [2]:
employee_data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['John', 'Emily', 'Sara', 'Tom', 'Anna'],
    'Department': ['HR', 'IT', 'Marketing', None, 'HR'],
    'Salary': [50000, 70000, None, 45000, 52000],
    'YearsAtCompany': [5, None, 8, 3, 4]
}

em = pd.DataFrame(employee_data)
em.head()

   EmployeeID   Name Department   Salary  YearsAtCompany
0         101   John         HR  50000.0             5.0
1         102  Emily         IT  70000.0             NaN
2         103   Sara  Marketing      NaN             8.0
3         104    Tom       None  45000.0             3.0
4         105   Anna         HR  52000.0             4.0

In [3]:
em_fillna = ['Salary', 'YearsAtCompany']

for emf in em_fillna:
    em[emf] = em[emf].fillna(em[emf].mean())
em

   EmployeeID   Name Department   Salary  YearsAtCompany
0         101   John         HR  50000.0             5.0
1         102  Emily         IT  70000.0             5.0
2         103   Sara  Marketing  54250.0             8.0
3         104    Tom       None  45000.0             3.0
4         105   Anna         HR  52000.0             4.0

In [4]:
product_data = {
    'ProductID': [1, 2, 3, 1, 4, 2],
    'ProductName': ['Laptop', 'Mouse', 'Monitor', 'Laptop', 'Keyboard', 'Mouse'],
    'Price': [1200, 25, 300, 1150, 45, 22],
    'QuantitySold': [10, 100, 50, 8, 70, 120]
}
pdd = pd.DataFrame(product_data)
pdd.head()

   ProductID ProductName  Price  QuantitySold
0          1      Laptop   1200            10
1          2       Mouse     25           100
2          3     Monitor    300            50
3          1      Laptop   1150             8
4          4    Keyboard     45            70

In [5]:
pdd = pdd.sort_values('Price').drop_duplicates('ProductID', keep='first')
pdd

   ProductID ProductName  Price  QuantitySold
5          2       Mouse     22           120
4          4    Keyboard     45            70
2          3     Monitor    300            50
3          1      Laptop   1150             8

In [6]:
car_data = {
    'Model': ['Sedan', 'SUV', 'Truck', 'Coupe', 'Convertible'],
    'Horsepower': [180, 250, 200, 170, 150],
    'MPG': [30, 20, 15, 35, 28],
    'Price': [30000, 45000, 40000, 28000, 32000]
}
cd = pd.DataFrame(car_data)
cd

         Model  Horsepower  MPG  Price
0        Sedan         180   30  30000
1          SUV         250   20  45000
2        Truck         200   15  40000
3        Coupe         170   35  28000
4  Convertible         150   28  32000

In [7]:
cd = cd.sort_values('Horsepower').head(3).sort_values('MPG',ascending=False)
cd

         Model  Horsepower  MPG  Price
3        Coupe         170   35  28000
0        Sedan         180   30  30000
4  Convertible         150   28  32000

In [8]:
football_data = {
    'PlayerID': [201, 202, 203, 204, 205],
    'Name': ['Ronaldo', 'Messi', 'Neymar', 'Mbappe', 'Kane'],
    'Position': ['Forward', 'Forward', 'Midfielder', 'Forward', 'Forward'],
    'GoalsScored': [600, 700, 400, 150, 200],
    'Age': [35, 33, 29, 22, 27]
}

fd = pd.DataFrame(football_data)
fd

   PlayerID     Name    Position  GoalsScored  Age
0       201  Ronaldo     Forward          600   35
1       202    Messi     Forward          700   33
2       203   Neymar  Midfielder          400   29
3       204   Mbappe     Forward          150   22
4       205     Kane     Forward          200   27

In [9]:
fd = fd[(fd['Position'] == 'Forward') & (fd['Age'] <= 30)]
fd

   PlayerID    Name Position  GoalsScored  Age
3       204  Mbappe  Forward          150   22
4       205    Kane  Forward          200   27